app/controllers/songs_controller.rb

    def create
        @song = Song.create!(song_params)
---
INSERT INTO "songs" ("name", "user_id", "album_id", "likes", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "First Song Upload"], ["user_id", 1], ["album_id", 1], ["likes", nil], ["created_at", "2023-03-16 22:38:07.769009"], ["updated_at", "2023-03-16 22:38:07.769009"]]

    def show

      @song = Song.find(params[:id])

      # Get the audio URL from the song instance
      audio_url = @song.audio_url

      # Check if the URL has expired
      if audio_url && Time.now.utc > @song.audio.metadata["goog-resumable-expiration"].to_time
        # Generate a new signed URL that is valid for 1 year
        audio_url = @song.audio.service_url(expires_in: 1.year)

        # Store the new signed URL in the song instance
        @song.update(audio: audio_url)
---
SELECT "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "songs" SET "updated_at" = ? WHERE "songs"."id" = ?  [["updated_at", "2023-03-17 04:18:14.327108"], ["id", 4]]