app/controllers/users_controller.rb

    def create
      puts "User params: #{:user_params.inspect}"
      @user = User.create!(user_params)
---
INSERT INTO "users" ("name", "email", "username", "created_at", "updated_at", "password_digest", "gender", "age", "user_type") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)