app/models/song.rb

SELECT "likes".* FROM "likes" WHERE "likes"."song_id" = ?  [["song_id", 1]]
---
    def likes
        return self.poly_likes.length